artillery.yaml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 10
      name: "Warm up the application"
scenarios:
  - name: "login and users test"
    flow:
      - post:
          url: '/login'
          json:
            login: "admin"
            password: "admin"
          capture:
            json: '$.token'
            as: 'token'
      - log: "Bearer {{token}}"
      - get:
          headers:
            authorization: 'Bearer {{token}}'
          url: '/users'